mdbsliguo/stm32_template_SPL/Drivers/dma/dma.c
/**
 * @file dma.c
 * @brief DMA驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的DMA驱动，支持DMA1/2所有通道，外设到内存、内存到外设、内存到内存传输
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_DMA_ENABLED

/* Include our header */
#include "dma.h"

#include "delay.h"
#include "nvic.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

/* 从board.h加载配置 */
static DMA_Config_t g_dma_configs[DMA_CHANNEL_MAX] = DMA_CONFIGS;

/* 初始化标志 */
static bool g_dma_initialized[DMA_CHANNEL_MAX] = {false};

/* 传输完成回调函数 */
static DMA_TransferCompleteCallback_t g_dma_callbacks[DMA_CHANNEL_MAX] = {NULL};
static void *g_dma_user_data[DMA_CHANNEL_MAX] = {NULL};

/* 中断回调函数数组（支持3种中断类型：TC、HT、TE） */
static DMA_IT_Callback_t g_dma_it_callbacks[DMA_CHANNEL_MAX][3] = {NULL};
static void *g_dma_it_user_data[DMA_CHANNEL_MAX][3] = {NULL};

/* 默认超时时间（毫秒） */
#define DMA_DEFAULT_TIMEOUT_MS  5000

/**
 * @brief 获取DMA通道外设指针
 * @param[in] channel DMA通道索引
 * @return DMA_Channel_TypeDef* DMA通道指针，失败返回NULL
 */
static DMA_Channel_TypeDef* DMA_GetChannelPeriph(DMA_Channel_t channel)
{
    switch (channel)
    {
        case DMA_CHANNEL_1_1: return DMA1_Channel1;
        case DMA_CHANNEL_1_2: return DMA1_Channel2;
        case DMA_CHANNEL_1_3: return DMA1_Channel3;
        case DMA_CHANNEL_1_4: return DMA1_Channel4;
        case DMA_CHANNEL_1_5: return DMA1_Channel5;
        case DMA_CHANNEL_1_6: return DMA1_Channel6;
        case DMA_CHANNEL_1_7: return DMA1_Channel7;
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
        case DMA_CHANNEL_2_1: return DMA2_Channel1;
        case DMA_CHANNEL_2_2: return DMA2_Channel2;
        case DMA_CHANNEL_2_3: return DMA2_Channel3;
        case DMA_CHANNEL_2_4: return DMA2_Channel4;
        case DMA_CHANNEL_2_5: return DMA2_Channel5;
#endif
        default: return NULL;
    }
}

/**
 * @brief 获取DMA外设时钟
 * @param[in] channel DMA通道索引
 * @return uint32_t 时钟使能值，失败返回0
 */
static uint32_t DMA_GetPeriphClock(DMA_Channel_t channel)
{
    if (channel <= DMA_CHANNEL_1_7)
    {
        return RCC_AHBPeriph_DMA1;
    }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
    else if (channel <= DMA_CHANNEL_2_5)
    {
        return RCC_AHBPeriph_DMA2;
    }
#endif
    return 0;
}

/**
 * @brief DMA初始化
 */
DMA_Status_t DMA_Init(DMA_Channel_t channel)
{
    DMA_InitTypeDef DMA_InitStructure;
    uint32_t dma_clock;
    DMA_Channel_TypeDef *dma_channel;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_configs[channel].enabled)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (g_dma_initialized[channel])
    {
        return DMA_OK;
    }
    
    /* 获取DMA通道外设指针 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    /* 获取DMA外设时钟 */
    dma_clock = DMA_GetPeriphClock(channel);
    if (dma_clock == 0)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    /* 使能DMA外设时钟 */
    RCC_AHBPeriphClockCmd(dma_clock, ENABLE);
    
    /* 配置DMA通道 */
    DMA_InitStructure.DMA_PeripheralBaseAddr = g_dma_configs[channel].peripheral_addr;
    DMA_InitStructure.DMA_MemoryBaseAddr = 0;  /* 稍后配置 */
    DMA_InitStructure.DMA_DIR = g_dma_configs[channel].direction;
    DMA_InitStructure.DMA_BufferSize = 0;  /* 稍后配置 */
    DMA_InitStructure.DMA_PeripheralInc = g_dma_configs[channel].peripheral_inc;
    DMA_InitStructure.DMA_MemoryInc = g_dma_configs[channel].memory_inc;
    DMA_InitStructure.DMA_PeripheralDataSize = g_dma_configs[channel].data_size;
    DMA_InitStructure.DMA_MemoryDataSize = g_dma_configs[channel].data_size;
    DMA_InitStructure.DMA_Mode = g_dma_configs[channel].mode;
    DMA_InitStructure.DMA_Priority = g_dma_configs[channel].priority;
    DMA_InitStructure.DMA_M2M = (g_dma_configs[channel].direction == DMA_DIR_MEMORY_TO_MEMORY) ? DMA_M2M_Enable : DMA_M2M_Disable;
    
    DMA_Init(dma_channel, &DMA_InitStructure);
    
    /* 标记为已初始化 */
    g_dma_initialized[channel] = true;
    
    return DMA_OK;
}

/**
 * @brief DMA反初始化
 */
DMA_Status_t DMA_Deinit(DMA_Channel_t channel)
{
    DMA_Channel_TypeDef *dma_channel;
    uint32_t dma_clock;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_OK;
    }
    
    /* 停止DMA传输 */
    DMA_Stop(channel);
    
    /* 禁用DMA通道 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel != NULL)
    {
        DMA_Cmd(dma_channel, DISABLE);
    }
    
    /* 获取DMA外设时钟 */
    dma_clock = DMA_GetPeriphClock(channel);
    if (dma_clock != 0)
    {
        /* 禁用DMA外设时钟 */
        RCC_AHBPeriphClockCmd(dma_clock, DISABLE);
    }
    
    /* 清除回调函数 */
    g_dma_callbacks[channel] = NULL;
    g_dma_user_data[channel] = NULL;
    
    /* 标记为未初始化 */
    g_dma_initialized[channel] = false;
    
    return DMA_OK;
}

/**
 * @brief 配置DMA传输（外设到内存或内存到外设）
 */
DMA_Status_t DMA_ConfigTransfer(DMA_Channel_t channel, uint32_t peripheral_addr,
                                uint32_t memory_addr, uint16_t data_size,
                                DMA_Direction_t direction, uint8_t data_width)
{
    DMA_InitTypeDef DMA_InitStructure;
    DMA_Channel_TypeDef *dma_channel;
    uint32_t peripheral_data_size, memory_data_size;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (memory_addr == 0 || data_size == 0)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (direction == DMA_DIR_MEMORY_TO_MEMORY)
    {
        return DMA_ERROR_INVALID_PARAM;  /* 使用DMA_ConfigMemoryToMemory */
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    /* 获取DMA通道外设指针 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
