mdbsliguo/stm32_template_SPL/Drivers/dma/dma.c
    /* 停止DMA传输 */
    DMA_Cmd(dma_channel, DISABLE);
    
    /* 根据数据宽度设置数据大小 */
    switch (data_width)
    {
        case 1:  /* 字节 */
            peripheral_data_size = DMA_PeripheralDataSize_Byte;
            memory_data_size = DMA_MemoryDataSize_Byte;
            break;
        case 2:  /* 半字 */
            peripheral_data_size = DMA_PeripheralDataSize_HalfWord;
            memory_data_size = DMA_MemoryDataSize_HalfWord;
            break;
        case 4:  /* 字 */
            peripheral_data_size = DMA_PeripheralDataSize_Word;
            memory_data_size = DMA_MemoryDataSize_Word;
            /* 数据大小需要按字对齐 */
            data_size = (data_size + 3) / 4;
            break;
        default:
            return DMA_ERROR_INVALID_PARAM;
    }
    
    /* 配置DMA通道 */
    DMA_InitStructure.DMA_PeripheralBaseAddr = peripheral_addr;
    DMA_InitStructure.DMA_MemoryBaseAddr = memory_addr;
    if (direction == DMA_DIR_PERIPHERAL_TO_MEMORY)
    {
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    }
    else if (direction == DMA_DIR_MEMORY_TO_PERIPHERAL)
    {
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    }
    else
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    DMA_InitStructure.DMA_BufferSize = data_size;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = peripheral_data_size;
    DMA_InitStructure.DMA_MemoryDataSize = memory_data_size;
    DMA_InitStructure.DMA_Mode = g_dma_configs[channel].mode;
    DMA_InitStructure.DMA_Priority = g_dma_configs[channel].priority;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    
    DMA_Init(dma_channel, &DMA_InitStructure);
    
    return DMA_OK;
}

/**
 * @brief 配置DMA内存到内存传输
 */
DMA_Status_t DMA_ConfigMemoryToMemory(DMA_Channel_t channel, uint32_t src_addr,
                                      uint32_t dst_addr, uint16_t data_size, uint8_t data_width)
{
    DMA_InitTypeDef DMA_InitStructure;
    DMA_Channel_TypeDef *dma_channel;
    uint32_t data_size_type;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (src_addr == 0 || dst_addr == 0 || data_size == 0)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    /* 获取DMA通道外设指针 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    /* 停止DMA传输 */
    DMA_Cmd(dma_channel, DISABLE);
    
    /* 根据数据宽度设置数据大小 */
    switch (data_width)
    {
        case 1:  /* 字节 */
            data_size_type = DMA_PeripheralDataSize_Byte;
            break;
        case 2:  /* 半字 */
            data_size_type = DMA_PeripheralDataSize_HalfWord;
            break;
        case 4:  /* 字 */
            data_size_type = DMA_PeripheralDataSize_Word;
            /* 数据大小需要按字对齐 */
            data_size = (data_size + 3) / 4;
            break;
        default:
            return DMA_ERROR_INVALID_PARAM;
    }
    
    /* 配置DMA通道 */
    DMA_InitStructure.DMA_PeripheralBaseAddr = src_addr;
    DMA_InitStructure.DMA_MemoryBaseAddr = dst_addr;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = data_size;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = data_size_type;
    DMA_InitStructure.DMA_MemoryDataSize = data_size_type;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;  /* 内存到内存不支持循环模式 */
    DMA_InitStructure.DMA_Priority = g_dma_configs[channel].priority;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Enable;
    
    DMA_Init(dma_channel, &DMA_InitStructure);
    
    return DMA_OK;
}

/**
 * @brief 启动DMA传输
 */
DMA_Status_t DMA_Start(DMA_Channel_t channel)
{
    DMA_Channel_TypeDef *dma_channel;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    /* 获取DMA通道外设指针 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    /* 清除传输完成标志 */
    if (channel <= DMA_CHANNEL_1_7)
    {
        DMA1->IFCR |= (DMA_IFCR_CTCIF1 << (channel * 4));
    }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
    else if (channel <= DMA_CHANNEL_2_5)
    {
        DMA2->IFCR |= (DMA_IFCR_CTCIF1 << ((channel - DMA_CHANNEL_2_1) * 4));
    }
#endif
    
    /* 使能DMA通道 */
    DMA_Cmd(dma_channel, ENABLE);
    
    return DMA_OK;
}

/**
 * @brief 停止DMA传输
 */
DMA_Status_t DMA_Stop(DMA_Channel_t channel)
{
    DMA_Channel_TypeDef *dma_channel;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    /* 获取DMA通道外设指针 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    /* 禁用DMA通道 */
    DMA_Cmd(dma_channel, DISABLE);
    
    return DMA_OK;
}

/**
 * @brief 等待DMA传输完成（阻塞式）
 */
DMA_Status_t DMA_WaitComplete(DMA_Channel_t channel, uint32_t timeout)
{
    uint32_t start_tick;
    uint32_t flag;
    DMA_TypeDef *dma;
    
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    /* 使用默认超时时间 */
    if (timeout == 0)
    {
        timeout = DMA_DEFAULT_TIMEOUT_MS;
    }
    
    /* 确定DMA和标志位 */
    if (channel <= DMA_CHANNEL_1_7)
    {
        dma = DMA1;
        flag = DMA_FLAG_TC1 << (channel * 4);
    }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
    else if (channel <= DMA_CHANNEL_2_5)
    {
        dma = DMA2;
        flag = DMA_FLAG_TC1 << ((channel - DMA_CHANNEL_2_1) * 4);
    }
#endif
    else
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    start_tick = Delay_GetTick();
    
    /* 等待传输完成 */
    while (DMA_GetFlagStatus(dma, flag) == RESET)
    {
        /* 检查超时 */
        uint32_t elapsed = Delay_GetElapsed(Delay_GetTick(), start_tick);
        if (elapsed > timeout)
        {
            return DMA_ERROR_TIMEOUT;
        }
    }
    
    /* 清除标志位 */
    if (channel <= DMA_CHANNEL_1_7)
    {
        DMA1->IFCR |= (DMA_IFCR_CTCIF1 << (channel * 4));
    }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
    else if (channel <= DMA_CHANNEL_2_5)
    {
        DMA2->IFCR |= (DMA_IFCR_CTCIF1 << ((channel - DMA_CHANNEL_2_1) * 4));
    }
#endif
    
