mdbsliguo/stm32_template_SPL/Drivers/dma/dma.c
    /* 调用回调函数 */
    if (g_dma_callbacks[channel] != NULL)
    {
        g_dma_callbacks[channel](channel, g_dma_user_data[channel]);
    }
    
    return DMA_OK;
}

/**
 * @brief 检查DMA传输是否完成
 */
uint8_t DMA_IsComplete(DMA_Channel_t channel)
{
    uint32_t flag;
    DMA_TypeDef *dma;
    
    if (channel >= DMA_CHANNEL_MAX)
    {
        return 0;
    }
    
    if (!g_dma_initialized[channel])
    {
        return 0;
    }
    
    /* 确定DMA和标志位 */
    if (channel <= DMA_CHANNEL_1_7)
    {
        dma = DMA1;
        flag = DMA_FLAG_TC1 << (channel * 4);
    }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
    else if (channel <= DMA_CHANNEL_2_5)
    {
        dma = DMA2;
        flag = DMA_FLAG_TC1 << ((channel - DMA_CHANNEL_2_1) * 4);
    }
#endif
    else
    {
        return 0;
    }
    
    if (DMA_GetFlagStatus(dma, flag) != RESET)
    {
        /* 清除标志位 */
        if (channel <= DMA_CHANNEL_1_7)
        {
            DMA1->IFCR |= (DMA_IFCR_CTCIF1 << (channel * 4));
        }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
        else if (channel <= DMA_CHANNEL_2_5)
        {
            DMA2->IFCR |= (DMA_IFCR_CTCIF1 << ((channel - DMA_CHANNEL_2_1) * 4));
        }
#endif
        
        /* 调用回调函数 */
        if (g_dma_callbacks[channel] != NULL)
        {
            g_dma_callbacks[channel](channel, g_dma_user_data[channel]);
        }
        
        return 1;
    }
    
    return 0;
}

/**
 * @brief 获取剩余传输数据量
 */
uint16_t DMA_GetRemainingDataSize(DMA_Channel_t channel)
{
    DMA_Channel_TypeDef *dma_channel;
    
    if (channel >= DMA_CHANNEL_MAX)
    {
        return 0;
    }
    
    if (!g_dma_initialized[channel])
    {
        return 0;
    }
    
    /* 获取DMA通道外设指针 */
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return 0;
    }
    
    return DMA_GetCurrDataCounter(dma_channel);
}

/**
 * @brief 设置DMA传输完成回调函数
 */
DMA_Status_t DMA_SetTransferCompleteCallback(DMA_Channel_t channel,
                                             DMA_TransferCompleteCallback_t callback,
                                             void *user_data)
{
    /* 参数校验 */
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    g_dma_callbacks[channel] = callback;
    g_dma_user_data[channel] = user_data;
    
    return DMA_OK;
}

/**
 * @brief 检查DMA是否已初始化
 */
uint8_t DMA_IsInitialized(DMA_Channel_t channel)
{
    if (channel >= DMA_CHANNEL_MAX)
    {
        return 0;
    }
    
    return g_dma_initialized[channel] ? 1 : 0;
}

/**
 * @brief 获取DMA通道外设指针
 */
DMA_Channel_TypeDef* DMA_GetChannel(DMA_Channel_t channel)
{
    if (channel >= DMA_CHANNEL_MAX)
    {
        return NULL;
    }
    
    if (!g_dma_initialized[channel])
    {
        return NULL;
    }
    
    return DMA_GetChannelPeriph(channel);
}

/**
 * @brief 设置DMA传输模式（正常/循环）
 */
DMA_Status_t DMA_SetMode(DMA_Channel_t channel, uint8_t mode)
{
    DMA_Channel_TypeDef *dma_channel;
    DMA_InitTypeDef DMA_InitStructure;
    
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    if (mode > 1)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    /* 停止DMA传输 */
    DMA_Cmd(dma_channel, DISABLE);
    
    /* 读取当前配置 */
    DMA_InitStructure.DMA_PeripheralBaseAddr = dma_channel->CPAR;
    DMA_InitStructure.DMA_MemoryBaseAddr = dma_channel->CMAR;
    DMA_InitStructure.DMA_DIR = (dma_channel->CCR & DMA_CCR1_DIR) ? DMA_DIR_PeripheralSRC : DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = dma_channel->CNDTR;
    DMA_InitStructure.DMA_PeripheralInc = (dma_channel->CCR & DMA_CCR1_PINC) ? DMA_PeripheralInc_Enable : DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = (dma_channel->CCR & DMA_CCR1_MINC) ? DMA_MemoryInc_Enable : DMA_MemoryInc_Disable;
    DMA_InitStructure.DMA_PeripheralDataSize = (dma_channel->CCR & DMA_CCR1_PSIZE) >> 8;
    DMA_InitStructure.DMA_MemoryDataSize = (dma_channel->CCR & DMA_CCR1_MSIZE) >> 10;
    DMA_InitStructure.DMA_Mode = (mode == 1) ? DMA_Mode_Circular : DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = (dma_channel->CCR & DMA_CCR1_PL) >> 12;
    DMA_InitStructure.DMA_M2M = (dma_channel->CCR & DMA_CCR1_MEM2MEM) ? DMA_M2M_Enable : DMA_M2M_Disable;
    
    /* 内存到内存不支持循环模式 */
    if (DMA_InitStructure.DMA_M2M == DMA_M2M_Enable && mode == 1)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    /* 重新配置DMA通道 */
    DMA_Init(dma_channel, &DMA_InitStructure);
    
    /* 更新配置表中的模式 */
    g_dma_configs[channel].mode = DMA_InitStructure.DMA_Mode;
    
    return DMA_OK;
}

/* ========== 中断模式功能实现 ========== */

/**
 * @brief 获取DMA中断类型对应的SPL库中断值
 */
static uint32_t DMA_GetITValue(DMA_IT_t it_type)
{
    switch (it_type)
    {
        case DMA_IT_TC: return DMA_IT_TC;
        case DMA_IT_HT: return DMA_IT_HT;
        case DMA_IT_TE: return DMA_IT_TE;
        default: return 0;
    }
}

/**
 * @brief 获取DMA通道对应的IRQn
 */
static IRQn_Type DMA_GetIRQn(DMA_Channel_t channel)
{
    switch (channel)
    {
        case DMA_CHANNEL_1_1: return DMA1_Channel1_IRQn;
        case DMA_CHANNEL_1_2: return DMA1_Channel2_IRQn;
        case DMA_CHANNEL_1_3: return DMA1_Channel3_IRQn;
        case DMA_CHANNEL_1_4: return DMA1_Channel4_IRQn;
        case DMA_CHANNEL_1_5: return DMA1_Channel5_IRQn;
        case DMA_CHANNEL_1_6: return DMA1_Channel6_IRQn;
        case DMA_CHANNEL_1_7: return DMA1_Channel7_IRQn;
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
        case DMA_CHANNEL_2_1: return DMA2_Channel1_IRQn;
        case DMA_CHANNEL_2_2: return DMA2_Channel2_IRQn;
        case DMA_CHANNEL_2_3: return DMA2_Channel3_IRQn;
        case DMA_CHANNEL_2_4: return DMA2_Channel4_IRQn;
        case DMA_CHANNEL_2_5: return DMA2_Channel5_IRQn;
#endif
        default: return (IRQn_Type)0;
    }
}

/**
 * @brief 使能DMA中断
 */
DMA_Status_t DMA_EnableIT(DMA_Channel_t channel, DMA_IT_t it_type)
{
    DMA_Channel_TypeDef *dma_channel;
    uint32_t it_value;
    IRQn_Type irqn;
    
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    if (it_type >= 3)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    it_value = DMA_GetITValue(it_type);
    if (it_value == 0)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    /* 使能DMA中断 */
    DMA_ITConfig(dma_channel, it_value, ENABLE);
    
    /* 使能NVIC中断 */
    irqn = DMA_GetIRQn(channel);
    if (irqn != 0)
    {
        NVIC_EnableIRQ(irqn);
    }
    
    return DMA_OK;
}

/**
 * @brief 禁用DMA中断
 */
DMA_Status_t DMA_DisableIT(DMA_Channel_t channel, DMA_IT_t it_type)
{
    DMA_Channel_TypeDef *dma_channel;
    uint32_t it_value;
    
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    if (it_type >= 3)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return DMA_ERROR_INVALID_CHANNEL;
    }
    
    it_value = DMA_GetITValue(it_type);
    if (it_value == 0)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    /* 禁用DMA中断 */
    DMA_ITConfig(dma_channel, it_value, DISABLE);
    
    return DMA_OK;
}

/**
 * @brief 设置DMA中断回调函数
 */
DMA_Status_t DMA_SetITCallback(DMA_Channel_t channel, DMA_IT_t it_type,
                                DMA_IT_Callback_t callback, void *user_data)
{
    if (channel >= DMA_CHANNEL_MAX)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    if (!g_dma_initialized[channel])
    {
        return DMA_ERROR_NOT_INITIALIZED;
    }
    
    if (it_type >= 3)
    {
        return DMA_ERROR_INVALID_PARAM;
    }
    
    g_dma_it_callbacks[channel][it_type] = callback;
    g_dma_it_user_data[channel][it_type] = user_data;
    
    return DMA_OK;
}

/**
 * @brief DMA中断服务函数
 */
void DMA_IRQHandler(DMA_Channel_t channel)
{
    DMA_Channel_TypeDef *dma_channel;
    DMA_TypeDef *dma;
    uint32_t flag_tc, flag_ht, flag_te;
    
    if (channel >= DMA_CHANNEL_MAX || !g_dma_initialized[channel])
    {
        return;
    }
    
    dma_channel = DMA_GetChannelPeriph(channel);
    if (dma_channel == NULL)
    {
        return;
    }
    
