mdbsliguo/stm32_template_SPL/Drivers/dma/dma.c
    /* 确定DMA和标志位 */
    if (channel <= DMA_CHANNEL_1_7)
    {
        dma = DMA1;
        flag_tc = DMA_FLAG_TC1 << (channel * 4);
        flag_ht = DMA_FLAG_HT1 << (channel * 4);
        flag_te = DMA_FLAG_TE1 << (channel * 4);
    }
#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
    else if (channel <= DMA_CHANNEL_2_5)
    {
        dma = DMA2;
        uint8_t ch_idx = channel - DMA_CHANNEL_2_1;
        flag_tc = DMA_FLAG_TC1 << (ch_idx * 4);
        flag_ht = DMA_FLAG_HT1 << (ch_idx * 4);
        flag_te = DMA_FLAG_TE1 << (ch_idx * 4);
    }
#endif
    else
    {
        return;
    }
    
    /* 处理传输完成中断（TC） */
    if (DMA_GetITStatus(dma_channel, DMA_IT_TC) != RESET)
    {
        DMA_ClearITPendingBit(dma, flag_tc);
        
        /* 调用回调函数 */
        if (g_dma_it_callbacks[channel][DMA_IT_TC] != NULL)
        {
            g_dma_it_callbacks[channel][DMA_IT_TC](channel, DMA_IT_TC, g_dma_it_user_data[channel][DMA_IT_TC]);
        }
        
        /* 同时调用传输完成回调（兼容旧接口） */
        if (g_dma_callbacks[channel] != NULL)
        {
            g_dma_callbacks[channel](channel, g_dma_user_data[channel]);
        }
    }
    
    /* 处理半传输中断（HT） */
    if (DMA_GetITStatus(dma_channel, DMA_IT_HT) != RESET)
    {
        DMA_ClearITPendingBit(dma, flag_ht);
        
        /* 调用回调函数 */
        if (g_dma_it_callbacks[channel][DMA_IT_HT] != NULL)
        {
            g_dma_it_callbacks[channel][DMA_IT_HT](channel, DMA_IT_HT, g_dma_it_user_data[channel][DMA_IT_HT]);
        }
    }
    
    /* 处理传输错误中断（TE） */
    if (DMA_GetITStatus(dma_channel, DMA_IT_TE) != RESET)
    {
        DMA_ClearITPendingBit(dma, flag_te);
        
        /* 调用回调函数 */
        if (g_dma_it_callbacks[channel][DMA_IT_TE] != NULL)
        {
            g_dma_it_callbacks[channel][DMA_IT_TE](channel, DMA_IT_TE, g_dma_it_user_data[channel][DMA_IT_TE]);
        }
    }
}

/* DMA中断服务程序入口 */
void DMA1_Channel1_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_1); }
void DMA1_Channel2_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_2); }
void DMA1_Channel3_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_3); }
void DMA1_Channel4_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_4); }
void DMA1_Channel5_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_5); }
void DMA1_Channel6_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_6); }
void DMA1_Channel7_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_1_7); }

#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL)
void DMA2_Channel1_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_1); }
void DMA2_Channel2_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_2); }
void DMA2_Channel3_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_3); }
void DMA2_Channel4_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_4); }
void DMA2_Channel5_IRQHandler(void) { DMA_IRQHandler(DMA_CHANNEL_2_5); }
#endif

#endif /* CONFIG_MODULE_DMA_ENABLED */

